### Basic Operations
1. **Enter the HBase Shell**:
   ```bash
   [a@hadoop102 hbase]$ bin/hbase shell
   ```
2. **View Help Command**:
   ```shell
   hbase(main):001:0> help
   ```
3. **List Tables**:
   ```shell
   hbase(main):002:0> list
   ```

### Table Operations
1. **Create Table**:
   ```shell
   hbase(main):002:0> create 'student', 'info'
   ```
2. **Insert Data into Table**:
   ```shell
   hbase(main):003:0> put 'student', '1001', 'info:sex', 'male'
   hbase(main):004:0> put 'student', '1001', 'info:age', '18'
   hbase(main):005:0> put 'student', '1002', 'info:name', 'Janna'
   hbase(main):006:0> put 'student', '1002', 'info:sex', 'female'
   hbase(main):007:0> put 'student', '1002', 'info:age', '20'
   ```
3. **Scan Table Data**:
   ```shell
   hbase(main):008:0> scan 'student'
   hbase(main):009:0> scan 'student', {STARTROW => '1001', STOPROW => '1001'}
   hbase(main):010:0> scan 'student', {STARTROW => '1001'}
   ```
4. **Describe Table Structure**:
   ```shell
   hbase(main):011:0> describe 'student'
   ```
5. **Update Specific Field Data**:
   ```shell
   hbase(main):012:0> put 'student', '1001', 'info:name', 'Nick'
   hbase(main):013:0> put 'student', '1001', 'info:age', '100'
   ```
6. **Get Data of a Specific Row or Column**:
   ```shell
   hbase(main):014:0> get 'student', '1001'
   hbase(main):015:0> get 'student', '1001', 'info:name'
   ```
7. **Count Rows in Table**:
   ```shell
   hbase(main):021:0> count 'student'
   ```
8. **Delete Data**:
   - Delete all data of a row:
     ```shell
     hbase(main):016:0> deleteall 'student', '1001'
     ```
   - Delete specific column data of a row:
     ```shell
     hbase(main):017:0> delete 'student', '1002', 'info:sex'
     ```
9. **Truncate Table Data**:
   ```shell
   hbase(main):018:0> truncate 'student'
   ```
   **Note**: To truncate a table, first disable it, then truncate it.
10. **Drop Table**:
    - First, disable the table:
      ```shell
      hbase(main):019:0> disable 'student'
      ```
    - Then, drop the table:

      ```shell
      hbase(main
        ):020:0> drop 'student'
      ```

      **Note**: If you directly drop the table, an error will occur: `ERROR: Table student is enabled. Disable it first`.
11. **Alter Table Information**:
    
    - Store 3 versions of data in the `info` column family:
      
      ```shell
      hbase(main):022:0> alter 'student', {NAME=>'info', VERSIONS=>3}
      hbase(main):022:0> get 'student', '1001', {COLUMN=>'info:name', VERSIONS=>3}
      ```